module TestConstants
  @@bad_words = {
    "приз"=>0.7,
    "сюрприз"=>0.5,
    
    "акц"=>0.6,
    "акці"=>0.6,
    "розыгрыш"=>0.7,
    "розыгрыва"=>0.7,
    "разыгра" => 0.7,
    "розіграш" => 0.7,
    "выйгра"=>0.7,
    "выигрыва"=>0.7,
    "выигра" => 0.7,
    "конкурс"=>0.7,
    "отрима" => 0.7,
    "получ" => 0.7,

    "подарок"=>0.6,
    "подар"=>0.6,
    "подарочн"=>0.6,
    "подарк"=> 0.6,
    "презент" => 0.6,
    "дар" => 0.6,
    "подарунк" => 0.6,
    "подарунок" => 0.6,
    
    "побед"=>0.6,
    "победител"=>0.6,    
    "везунчик"=>0.5,
    "участ"=>0.5,
    "участв"=>0.5,
    "учасників"=>0.5,
    "учасник"=>0.5,
    "поучаствова" =>0.5,
    "участник"=>0.5,
    "переможц"=>0.5,
    "переможців"=>0.5,

    "услов"=>0.5,
    "умов"=>0.5,
    
    "репост"=>0.15,
    "переп"=> 0.15,
    "расшар"=>0.15,
    "подел" => 0.15,
    "поділит" => 0.15,
    "share" => 0.15,
    
    "лайкнул"=>0.15,
    "лайкнут" => 0.15,
    "лайк" => 0.15,
    "нрав" => 0.15,
    "like" => 0.15,

    
    "присоедин"=>0.3,
    "подпиш"=>0.3,
    "подписчик"=>0.3,
    
    "коммент" => 0.15,
    "комментар"=>0.15,
    "коментар" => 0.15,
    "comment" => 0.15,
    
    "голос"=>0.2,
    "случай"=>0.5,
    "случайн"=>0.5,
    "рандомн"=>0.5,
    "рекоменд" => 0.15
    }

  @@ph_post_percent = 0.5
  def self.bad_words
    @@bad_words
  end

  def self.bad_words=bw
    @@bad_words = bw
  end

  def self.ph_post_percent
    @@ph_post_percent
  end

  def self.ph_post_percent= per
    @@ph_post_percent = per
  end

end